In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('banklist.csv')

In [3]:
df.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

In [6]:
df.shape

(551, 7)

1.What are the column names?

In [4]:
df.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

In [5]:
list(df.columns)

['Bank Name',
 'City',
 'ST',
 'CERT',
 'Acquiring Institution',
 'Closing Date',
 'Updated Date']

2.How many States (ST) are represented in this data set?

In [8]:
len(df['ST'].unique())

44

In [9]:
df['ST'].nunique()

44

3.Get a list or array of all the states in the data set.

In [7]:
df['ST'].unique()

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

4.What are the top 5 states with the most failed banks?

In [ ]:
# I want a list of 44 states where present the total no of **failed banks per each state

In [11]:
df['ST'].value_counts().iloc[:5]

GA    93
FL    75
IL    67
CA    41
MN    23
Name: ST, dtype: int64

5.What are the top 5 acquiring institutions?

In [12]:
df['Acquiring Institution'].value_counts().iloc[:5]

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

6.How many banks has the State Bank of Texas acquired? How many of them were actually in Texas?

Ans : State Bank of Texas acquired 3 banks. And no one  actually in Texas

In [13]:
df[df['Acquiring Institution']=='State Bank of Texas']

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

In [14]:
df1=df[df['Acquiring Institution']=='State Bank of Texas']
len(df1)

3

In [16]:
df[df['Acquiring Institution']=='State Bank of Texas' and df['City']=='Texas' ]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

7.What is the most common city in California for a bank to fail in?

In [20]:
df[df['ST']=='CA'].shape

(41, 7)

In [23]:
df[df['ST']=='CA']['City'].value_counts().head(1)

Los Angeles    4
Name: City, dtype: int64

8.How many failed banks don't have the word "Bank" in their name?

In [28]:
sum(df['Bank Name'].apply(lambda name : 'Bank' not in name) )

14

9.How many bank names start with the letter 's' ?

In [30]:
sum(df['Bank Name'].apply(lambda name: name[0].upper()=='S'))

53

10.How many CERT values are above 20000 ?

In [32]:
len(df[df['CERT']>20000])

417

11.How many bank names consist of just two words?

In [36]:
k='Hello and welcome to mentorskool'.split(' ')
len(k)

5

In [37]:
sum(df['Bank Name'].apply(lambda name:len(name.split(' '))==2 ))

113